

&НаКлиенте
Процедура ЗагрузитьФото(Команда)
	
	АдресВыбраннойКартинки = "";
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьФотоЗавершение", ЭтотОбъект, Новый Структура("АдресВыбраннойКартинки", АдресВыбраннойКартинки)), АдресВыбраннойКартинки,,Истина,УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФотоЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	АдресВыбраннойКартинки = ДополнительныеПараметры.АдресВыбраннойКартинки;
	
	Если Результат Тогда
		АдресКартинки = АдресВыбраннойКартинки;
		Модифицированность = Истина;		
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда 
		
		ТекущийОбъект.ДанныеКартинки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
		
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеКартинки");
	
КонецПроцедуры

