
&НаСервереБезКонтекста
Функция ТоварыНоменклатураПриИзмененииНаСервере(Товар)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "Выбрать
	|  ЦенаПродажи
	|ИЗ
	|  Справочник.Номенклатура
	|ГДЕ
	|  Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ЦенаПродажи;
	
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Товар = Элементы.Товары.ТекущиеДанные.Номенклатура;
	Элементы.Товары.ТекущиеДанные.Цена = ТоварыНоменклатураПриИзмененииНаСервере(Товар);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	КлиентскаяРаботаСДокументами.СуммаЭлементаТЧ(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	КлиентскаяРаботаСДокументами.СуммаЭлементаТЧ(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	Если Объект.Товары.Количество() = 0 Тогда 
		Сообщить("Товаров нет, печать отменяется");
		Возврат 0;
	КонецЕсли;
	
	Если НЕ Объект.Проведен Тогда 
		Сообщить("Документ не проведён");
		Возврат 0;
	КонецЕсли;
	
	Табдок = Новый ТабличныйДокумент;
	Макет = Документы.РасходнаяНакладная.ПолучитьМакет("ТН2");
	
	ОблШапка = Макет.ПолучитьОбласть("ОблШапка");
	ОблСтрока = Макет.ПолучитьОбласть("ОблСтрока");
	ОблПодвал = Макет.ПолучитьОбласть("ОблПодвал");
	
	ОблШапка.Параметры.УНПполучателя = Объект.Контрагент.УНП;
	ОблШапка.Параметры.Дата = Формат(Объект.Дата, "ДЛФ=DD");
	ОблШапка.Параметры.Грузополучатель = Объект.Контрагент;
	ОблШапка.Параметры.ЮрАдрес = Объект.Контрагент.ЮрАдрес;
	
	ТабДок.Вывести(ОблШапка);
	
	Для Каждого стр из Объект.Товары Цикл
		ОблСтрока.Параметры.Заполнить(СТР);
		Табдок.Вывести(ОблСтрока);
	КонецЦикла;
	
	СуммаИтого = Объект.Товары.Итог("Сумма");
	ОблПодвал.Параметры.СуммаСНДС = ЧислоПрописью(СуммаИтого,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	Табдок.Вывести(ОблПодвал);
	
	ТабДок.ОтображатьГруппировки = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	Табдок = ПечатьНаСервере();
	
	Если Табдок <> 0 Тогда 
		Табдок.Показать();
	КонецЕсли;
	
КонецПроцедуры
