
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные.Номенклатура;
	Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦену(Товар);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар)
	Возврат Товар.ЦенаПродажи;
КонецФункции


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	КлиентскаяРаботаСДокументами.СуммаЭлементаТЧ(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	КлиентскаяРаботаСДокументами.СуммаЭлементаТЧ(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры


&НаСервере
Процедура СвернутьТЧНаСервере()
	
	ТЗ = Объект.Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	Объект.Товары.Загрузить(ТЗ);
	
КонецПроцедуры


&НаКлиенте
Процедура СвернутьТЧ(Команда)
	СвернутьТЧНаСервере();
КонецПроцедуры

