
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Товар = Элементы.Товары.ТекущиеДанные.Номенклатура;

	Элементы.Товары.ТекущиеДанные.Цена = ПолучитьЦену(Товар);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "Выбрать
	|  ЦенаПродажи
	|ИЗ
	|  Справочник.Номенклатура
	|ГДЕ
	|  Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ЦенаПродажи;

КонецФункции


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	КлиентскаяРаботаСДокументами.СуммаЭлементаТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	КлиентскаяРаботаСДокументами.СуммаЭлементаТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры


&НаСервере
Процедура СвернутьТЧНаСервере()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = Объект.Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура, Цена", "Количество, Сумма");
	Объект.Товары.Загрузить(ТЗ);
	
КонецПроцедуры


&НаКлиенте
Процедура СвернутьТЧ(Команда)
	
	СвернутьТЧНаСервере();
	
КонецПроцедуры


&НаСервере
Функция Печать1НаСервере()

	//Попытка реализовать проверку количества строк в счёте
	Если Объект.Товары.Количество() = 0 Тогда 
		Сообщить("Товаров нет, печать отменяется");
		Возврат 0;
	КонецЕсли;
	
	//Проверка проведения
	Если НЕ Объект.Проведен Тогда 
		Сообщить("Документ не проведён");
		Возврат 0;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.СчетНаОплату.ПолучитьМакет("Макет");
	
	ОблШапка = Макет.ПолучитьОбласть("ОблШапка");
	ОблСтрока = Макет.ПолучитьОбласть("ОблСтрока");
	ОблПодвал = Макет.ПолучитьОбласть("ОблПодвал");
	
	ОблШапка.Параметры.Номер = Объект.Номер;
	ОблШапка.Параметры.Дата = Формат(Объект.Дата, "ДЛФ=DD");
	ОблШапка.Параметры.Контрагент = Объект.Контрагент;
	ОблШапка.Параметры.Договор = Объект.Договор;
	ТабДок.Вывести(ОблШапка);
	
	Для Каждого СТР Из Объект.Товары Цикл 
		
		ОблСтрока.Параметры.Заполнить(СТР);
		ТабДок.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	СуммаИтого = Объект.Товары.Итог("Сумма");
	ОблПодвал.Параметры.СуммаПрописью = ЧислоПрописью(СуммаИтого,,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	ТабДок.Вывести(ОблПодвал);
	
	ТабДок.ОтображатьГруппировки = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	
	Возврат ТабДок;
	
КонецФункции


&НаКлиенте
Процедура Печать1(Команда)
	
	ТабДок = Печать1НаСервере();
	
	Если ТабДок <> 0 Тогда
		ТабДок.Показать();
	КонецЕсли;
	
КонецПроцедуры

