

&НаСервереБезКонтекста
Функция СписокПокупныхЦен(ЮрЛицо, Дата, Товар, Склад)
	
	ЗапросСписка = Новый Запрос;
	
	ЗапросСписка.Текст = 
	  "ВЫБРАТЬ
	  |	СтоимостьТоваровПоФактуОстатки.Цена КАК Цена
	  |ИЗ
	  |	РегистрНакопления.СтоимостьТоваровПоФакту.Остатки(
	  |			&Дата,
	  |			Номенклатура.Ссылка = &Товар
	  |				И Склад = &Склад И ЮрЛицо = &ЮрЛицо) КАК СтоимостьТоваровПоФактуОстатки";
	
	ЗапросСписка.УстановитьПараметр("Товар", Товар);
	ЗапросСписка.УстановитьПараметр("Дата", Дата);
	ЗапросСписка.УстановитьПараметр("Склад", Склад);
	ЗапросСписка.УстановитьПараметр("ЮрЛицо", ЮрЛицо);
	РезультатЗапросСписка = ЗапросСписка.Выполнить();
	ВыборкаСписка = РезультатЗапросСписка.Выбрать();
	
	СписокЦен = Новый Массив;
	Пока ВыборкаСписка.Следующий() Цикл
		СписокЦен.Добавить(ВыборкаСписка.Цена);
	КонецЦикла;
	
	Возврат СписокЦен;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТоварыНоменклатураПриИзмененииНаСервере(Товар)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "Выбрать
	|  ЦенаПродажи
	|ИЗ
	|  Справочник.Номенклатура
	|ГДЕ
	|  Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ЦенаПродажи;
	
КонецФункции

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	
	Товар = Элементы.Услуги.ТекущиеДанные.Номенклатура;
		
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	КлиентскаяРаботаСДокументами.СуммаУслугЭлементаТЧ(Элементы.Услуги.ТекущиеДанные);
	КлиентскаяРаботаСДокументами.РасчетНДСЭТЧ(Элементы.Услуги.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	КлиентскаяРаботаСДокументами.СуммаУслугЭлементаТЧ(Элементы.Услуги.ТекущиеДанные);
	КлиентскаяРаботаСДокументами.РасчетНДСЭТЧ(Элементы.Услуги.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда 
		СТР = Элементы.Услуги.ТекущиеДанные;
		СТР.СтавкаНДС = Объект.СтавкаНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСтавкаНДСПриИзменении(Элемент)
	
	КлиентскаяРаботаСДокументами.СуммаУслугЭлементаТЧ(Элементы.Услуги.ТекущиеДанные);
	КлиентскаяРаботаСДокументами.РасчетНДСЭТЧ(Элементы.Услуги.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрЛицоПриИзменении(Элемент)
	Объект.СтавкаНДС = ОрганизацияПриИзмененииНаСервере(Объект.ЮрЛицо);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	      "ВЫБРАТЬ
	      |	ЮрЛица.СтавкаНДСПриРеализации КАК СтавкаНДСПриРеализации
	      |ИЗ
	      |	Справочник.ЮрЛица КАК ЮрЛица
	      |ГДЕ
	      |	ЮрЛица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.ЮрЛицо);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Объект.СтавкаНДС = Выборка.СтавкаНДСПриРеализации;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОрганизацияПриИзмененииНаСервере(ЮрЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЮрЛица.СтавкаНДСПриРеализации КАК СтавкаНДСПриРеализации
	|ИЗ
	|	Справочник.ЮрЛица КАК ЮрЛица
	|ГДЕ
	|	ЮрЛица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЮрЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.СтавкаНДСПриРеализации;
	
КонецФункции