
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Покупатель теперь должен нам
	Проводка = Движения.РегистрБухгалтерии.Добавить();
	Проводка.ЮрЛицо = ЮрЛицо;
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.ПланСчетов.С62;
	Проводка.СчетКт = ПланыСчетов.ПланСчетов.С90с1;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	Проводка.Сумма = Услуги.Итог("СуммаСНДС");
	
	// Минусуем НДС
	Если Услуги.Итог("СуммаНДС") <> 0 Тогда
		Проводка = Движения.РегистрБухгалтерии.Добавить();
		Проводка.ЮрЛицо = ЮрЛицо;
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.ПланСчетов.С90с2;
		Проводка.СчетКт = ПланыСчетов.ПланСчетов.С68с2;
		Проводка.Сумма = Услуги.Итог("СуммаНДС");
	КонецЕсли;
	
	// Здесь будет списание материалов, которые ушли на оказание услуги.
	// И скорее всего по принципу расходной накладной сделаю.
	//Проводка = Движения.РегистрБухгалтерии.Добавить();
	//Проводка.ЮрЛицо = ЮрЛицо;
	//Проводка.Период = Дата;
	//Проводка.СчетДт = ПланыСчетов.ПланСчетов.;
	//Проводка.СчетКт = ПланыСчетов.ПланСчетов.;
	
	Движения.РегистрБухгалтерии.Записывать = Истина;
		
КонецПроцедуры
