
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура", "Количество");
	
	Движения.ОстаткиТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла; 
	
	//Сейчас пойдёт обусловленное проведение - чтобы не ушли в минус. Сначала запишу обороты, сверю и в случае чего сделаю отмену проведения.

	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|  ОстаткиТоваровОстатки.Номенклатура,
	|  ОстаткиТоваровОстатки.КоличествоОстаток
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
	|ГДЕ
	|  ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		Отказ = Истина;
	КонецЕсли;
	
	  
	
КонецПроцедуры
