
Процедура ОбработкаПроведения(Отказ, Режим)
	
#Область ДЗ_4	
	Движения.РасчетыСПокупателями.Записывать = Истина;
	Движение = Движения.РасчетыСПокупателями.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.СуммаДолга =  Товары.Итог("Сумма");
#КонецОбласти
	
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ = Товары.Выгрузить();
	//ТЗ.Свернуть("Номенклатура", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|Номенклатура,
	|СУММА(Количество)
	|ИЗ
	|Документы.РасходнаяНакладная.Товары
	|ГДЕ
	|Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	//Для Каждого ТекСтрокаТовары Из ТЗ Цикл
	Пока Выборка.Следующий() Цикл 
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		
		
		
		
	КонецЦикла; 
	
	//Сейчас пойдёт обусловленное проведение - чтобы не ушли в минус. Сначала запишу обороты, сверю и в случае чего сделаю отмену проведения.
	//&Склад = Склад для отбора по складам.

	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|  ОстаткиТоваровОстатки.Номенклатура,
	|  ОстаткиТоваровОстатки.КоличествоОстаток
	|ИЗ
	//|  РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени) КАК ОстаткиТоваровОстатки
	|  РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Склад = &Склад) КАК ОстаткиТоваровОстатки
	|ГДЕ
	|  ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	//А тут уже условие по времени, чтобы можно было проводить документы задним числом, даже если по итогу уйдём в минус. Более подробно в конспекте.
	Граница = Новый Граница(МоментВремени(),ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Склад", Склад);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
  			Сообщить("Мало товара " + Выборка.Номенклатура + " нужно ещё " + (-Выборка.КоличествоОстаток));
		КонецЦикла

	КонецЕсли;
	
	  
	
КонецПроцедуры
