
Процедура ОбработкаПроведения(Отказ, Режим)
	
#Область ДЗ_4	
	Движения.РасчетыСПокупателями.Записывать = Истина;
	Движение = Движения.РасчетыСПокупателями.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.СуммаДолга =  Товары.Итог("Сумма");
#КонецОбласти
	
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ = Товары.Выгрузить();
	//ТЗ.Свернуть("Номенклатура", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|Номенклатура,
	|СУММА(Количество)
	|ПОМЕСТИТЬ ДокТЧ
	|ИЗ
	|Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	|ГДЕ
	|Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|Номенклатура
	|;
	|ВЫБРАТЬ * ИЗ ДокТЧ";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	//Для Каждого ТекСтрокаТовары Из ТЗ Цикл
	Пока Выборка.Следующий() Цикл 
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = Выборка.Количество;
		
		
		
		
	КонецЦикла; 
	
	//Сейчас пойдёт обусловленное проведение - чтобы не ушли в минус. Сначала запишу обороты, сверю и в случае чего сделаю отмену проведения.
	//&Склад = Склад для отбора по складам.

	Движения.Записать();
	
	//Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|  ОстаткиТоваровОстатки.Номенклатура,
	|  ОстаткиТоваровОстатки.КоличествоОстаток
	|ИЗ
	//|  РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени) КАК ОстаткиТоваровОстатки
	|  РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени, Склад = &Склад) КАК ОстаткиТоваровОстатки
	|ГДЕ
	|  ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	//А тут уже условие по времени, чтобы можно было проводить документы задним числом, даже если по итогу уйдём в минус. Более подробно в конспекте.
	Граница = Новый Граница(МоментВремени(),ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МассивТоваров", Товары.ВыгрузитьКолонку("Номенклатура"));

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
  			Сообщить("Мало товара " + Выборка.Номенклатура + " нужно ещё " + (-Выборка.КоличествоОстаток));
		КонецЦикла

	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	                 |	СтоимостьТоваровОстатки.Номенклатура КАК Номенклатура,
	                 |	СтоимостьТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
	                 |	СтоимостьТоваровОстатки.СтоимостьОстаток КАК СтоимостьОстаток
	                 |ПОМЕСТИТЬ Остатки
	                 |ИЗ
	                 |	РегистрНакопления.СтоимостьТоваров.Остатки(
	                 |			,
	                 |			Номенклатура В
	                 |				(ВЫБРАТЬ
	                 |					ДокТЧ.Номенклатура КАК Номенклатура
	                 |				ИЗ
	                 |					ДокТЧ КАК ДокТЧ)) КАК СтоимостьТоваровОстатки
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ДокТЧ.Номенклатура КАК Номенклатура,
	                 |	ДокТЧ.Количество КАК Количество,
	                 |	Остатки.КоличествоОстаток КАК КоличествоОстаток,
	                 |	Остатки.СтоимостьОстаток КАК СтоимостьОстаток
	                 |ИЗ
	                 |	ДокТЧ КАК ДокТЧ
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	                 |		ПО ДокТЧ.Номенклатура = Остатки.Номенклатура";
					 
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Себестоимость = Выборка.Количество / Выборка.КоличествоОстаток * Выборка.СтоимостьОстаток;
		Движение = Движения.СтоимостьТоваров.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Количество = Выборка.Количество;
		Движение.Стоимость = Себестоимость;
		
	КонецЦикла;
	Движения.СтоимостьТоваров.Записывать = Истина;	
	  
	
КонецПроцедуры
