
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура", "Количество");
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла; 
	
	//Сейчас пойдёт обусловленное проведение - чтобы не ушли в минус. Сначала запишу обороты, сверю и в случае чего сделаю отмену проведения.

	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|  ОстаткиТоваровОстатки.Номенклатура,
	|  ОстаткиТоваровОстатки.КоличествоОстаток
	|ИЗ
	|  РегистрНакопления.ОстаткиТоваров.Остатки(&МоментВремени) КАК ОстаткиТоваровОстатки
	|ГДЕ
	|  ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Граница = Новый Граница(МоментВремени(),ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		Отказ = Истина;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
  			Сообщить("Мало товара " + Выборка.Номенклатура + " нужно ещё " + (-Выборка.КоличествоОстаток));
		КонецЦикла

	КонецЕсли;
	
	  
	
КонецПроцедуры
