
&НаСервереБезКонтекста
Функция СписокПокупныхЦен(ЮрЛицо, Дата, Товар, Склад)
	
	ЗапросСписка = Новый Запрос;
	
	ЗапросСписка.Текст = 
	  "ВЫБРАТЬ
	  |	СтоимостьТоваровПоФактуОстатки.Цена КАК Цена
	  |ИЗ
	  |	РегистрНакопления.СтоимостьТоваровПоФакту.Остатки(
	  |			&Дата,
	  |			Номенклатура.Ссылка = &Товар
	  |				И Склад = &Склад И ЮрЛицо = &ЮрЛицо) КАК СтоимостьТоваровПоФактуОстатки";
	
	ЗапросСписка.УстановитьПараметр("Товар", Товар);
	ЗапросСписка.УстановитьПараметр("Дата", Дата);
	ЗапросСписка.УстановитьПараметр("ЮрЛицо", ЮрЛицо);
	ЗапросСписка.УстановитьПараметр("Склад", Склад);
	РезультатЗапросСписка = ЗапросСписка.Выполнить();
	ВыборкаСписка = РезультатЗапросСписка.Выбрать();
	
	СписокЦен = Новый Массив;
	Пока ВыборкаСписка.Следующий() Цикл
		СписокЦен.Добавить(ВыборкаСписка.Цена);
	КонецЦикла;
	
	Возврат СписокЦен;
	
КонецФункции


&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.Материалы.ТекущиеДанные.СчетУчета = ПредопределенноеЗначение("ПланСчетов.ПланСчетов.С10с1");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриобретенияПриИзменении(Элемент)
	
	СТЧ = Элементы.Материалы.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.ЦенаПриобретения * СТЧ.Количество;
	
КонецПроцедуры


&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	СТЧ = Элементы.Материалы.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.ЦенаПриобретения * СТЧ.Количество;
	
КонецПроцедуры


&НаКлиенте
Процедура МатериалыЦенаПриобретенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Товар = Элементы.Материалы.ТекущиеДанные.Номенклатура;
	МассивЦен = СписокПокупныхЦен(Объект.ЮрЛицо, Объект.Дата, Товар, Объект.Склад);
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивЦен);
	
КонецПроцедуры

