
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РасчетыСПокупателями.Записывать = Истина;
	Движение = Движения.РасчетыСПокупателями.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.ЮрЛицо = ЮрЛицо;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.СуммаДолга = Сумма;
	
	Движения.НаличностьВКассе.Записывать = Истина;
	Движение = Движения.НаличностьВКассе.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.ЮрЛицо = ЮрЛицо;
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	
	Движения.РегистрБухгалтерии.Записывать = Истина;
	Проводка = Движения.РегистрБухгалтерии.Добавить();
	Проводка.Период = Дата;
	Проводка.ЮрЛицо = ЮрЛицо;
	Проводка.СчетДт = ПланыСчетов.ПланСчетов.С50;
	Проводка.СчетКт = ПланыСчетов.ПланСчетов.С62;
	Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	Проводка.Сумма = Сумма; 
	
КонецПроцедуры
