
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РасчетыСПокупателями.Записывать = Истина;
	Движение = Движения.РасчетыСПокупателями.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.СуммаДолга = Сумма;
	
	Движения.НаличностьВКассе.Записывать = Истина;
	Движение = Движения.НаличностьВКассе.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	
КонецПроцедуры
