
&НаСервереБезКонтекста
Функция ТоварыНоменклатураПриИзмененииНаСервере(Товар)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "Выбрать
	|  ЦенаПродажи
	|ИЗ
	|  Справочник.Номенклатура
	|ГДЕ
	|  Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ЦенаПродажи;
	
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Товар = Элементы.Товары.ТекущиеДанные.Номенклатура;
 	Элементы.Товары.ТекущиеДанные.Цена = ТоварыНоменклатураПриИзмененииНаСервере(Товар);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	КлиентскаяРаботаСДокументами.СуммаПриходТЧ(Элементы.Товары.ТекущиеДанные);
	КлиентскаяРаботаСДокументами.РасчетНДСЭТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	КлиентскаяРаботаСДокументами.СуммаПриходТЧ(Элементы.Товары.ТекущиеДанные);
	КлиентскаяРаботаСДокументами.РасчетНДСЭТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	КлиентскаяРаботаСДокументами.РасчетНДСЭТЧ(Элементы.Товары.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.Товары.ТекущиеДанные.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	Элементы.Товары.ТекущиеДанные.СчетУчета = ПредопределенноеЗначение("ПланСчетов.ПланСчетов.С41с1");	
	
КонецПроцедуры
