&НаКлиенте
Процедура ОбновитьФИО()
	Объект.Наименование = Объект.Фамилия + " " + Лев(Объект.Имя, 1) + ". " + Лев(Объект.Отчество, 1) + ".";
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьПолСотрудника(Отчество)
	
	Если Прав(Отчество, 2) = "ич" Тогда 
		ПолСотрудника = Перечисления.ПолСотрудника.Мужской;
	ИначеЕсли Прав(Отчество, 2) = "на" Тогда 
		ПолСотрудника = Перечисления.ПолСотрудника.Женский;
	КонецЕсли;
	
	Возврат ПолСотрудника;
	
КонецФункции


&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	ОбновитьФИО();
	Объект.ПолСотрудника = ОбновитьПолСотрудника(Объект.Отчество);
	
КонецПроцедуры
