
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Результат = ПослеЗаписиНаСервере(Объект.Ссылка);
	
	Если Результат > 0 Тогда 
		ПоказатьПредупреждение(,"Денег в кассе минус " + Результат + " рублей");
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКОнтекста
Функция ПослеЗаписиНаСервере(Ссылка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаличностьВКассеОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.НаличностьВКассе.Остатки(&МоментВремени, ) КАК НаличностьВКассеОстатки
	|ГДЕ
	|	НаличностьВКассеОстатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Включая));
	
	РезультатЗапрос = Запрос.Выполнить();
	
	Если НЕ РезультатЗапрос.Пустой() Тогда 
		Выборка = РезультатЗапрос.Выбрать();
		Выборка.Следующий();
		Возврат -Выборка.СуммаОстаток;
	Иначе 
		Возврат 0;
	КонецЕсли; 	
	
КонецФункции
