
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Проводка = Движения.РегистрБухгалтерии.Добавить();
	Проводка.Период = Дата;
	Проводка.ЮрЛицо = ЮрЛицо;
	Проводка.СчетДт = ПланыСчетов.ПланСчетов.С26;
	Проводка.СчетКт = ПланыСчетов.ПланСчетов.С71;
	Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудник] = Сотрудник;
	
	Если Дата > '20190323' Тогда 
		Суточные = 9;
	Иначе 
		Сообщить("Введите дату после 23 марта 2019 года.");
	КонецЕсли;
	
	Если Проживание = Перечисления.ПроживаниеС23марта2019.МинскИОбластныеЦентры Тогда 
		ПроживаниеСутки = 50;
	ИначеЕсли Проживание = Перечисления.ПроживаниеС23марта2019.РайонныеЦентры Тогда 
		ПроживаниеСутки = 25;
	Иначе 
		ПроживаниеСутки = 20;
	КонецЕсли;
	
	Сумма = Суточные * ДнейКомандировки + ПроживаниеСутки * (ДнейКомандировки - 1);
	Проводка.Сумма = Сумма;
	
	Движения.РегистрБухгалтерии.Записывать = Истина;	
	
КонецПроцедуры
