
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ = Товары.Выгрузить();
	//ТЗ.Свернуть("Номенклатура", "Количество, Сумма");
	
	Движения.РегистрБухгалтерии.Записывать = Истина;
				
	Если ЮрЛицо.УчетСтоимости = Перечисления.УчетСтоимости.ФИФО ИЛИ ЮрЛицо.УчетСтоимости = Перечисления.УчетСтоимости.Средневзвешенное Тогда
		
		Движения.ОстаткиТоваров.Записывать = Истина;
		Движения.СтоимостьТоваров.Записывать = Истина;
	
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.ЮрЛицо = ЮрЛицо;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			 
			Движение = Движения.СтоимостьТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Партия = Ссылка;
			Движение.ЮрЛицо = ЮрЛицо;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Стоимость = ТекСтрокаТовары.Сумма;
			
			Проводка = Движения.РегистрБухгалтерии.Добавить();
			Проводка.ЮрЛицо = ЮрЛицо;
			Проводка.Период = Дата;
			Проводка.СчетДт = ТекСтрокаТовары.СчетУчета;
			Проводка.СчетКт = ПланыСчетов.ПланСчетов.С60;
			Проводка.СубконтоДт.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Проводка.СубконтоДт.Склады = Склад;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.КоличествоДт = ТекСтрокаТовары.Количество;
			Проводка.Сумма = ТекСтрокаТовары.Сумма;
			
		КонецЦикла;
		
			
	ИначеЕсли ЮрЛицо.УчетСтоимости = Перечисления.УчетСтоимости.Себестоимость Тогда
		
		Движения.СтоимостьТоваровПоФакту.Записывать = Истина;
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Движение = Движения.СтоимостьТоваровПоФакту.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ЮрЛицо = ЮрЛицо;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Цена = ТекСтрокаТовары.Цена;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Стоимость = ТекСтрокаТовары.Сумма;
			
			Проводка = Движения.РегистрБухгалтерии.Добавить();
			Проводка.ЮрЛицо = ЮрЛицо;
			Проводка.Период = Дата;
			Проводка.СчетДт = ТекСтрокаТовары.СчетУчета;
			Проводка.СчетКт = ПланыСчетов.ПланСчетов.С60;
			Проводка.СубконтоДт.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Проводка.СубконтоДт.Склады = Склад;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			Проводка.КоличествоДт = ТекСтрокаТовары.Количество;
			Проводка.Сумма = ТекСтрокаТовары.Сумма;
			
		КонецЦикла;
			
	КонецЕсли;
		
	Проводка = Движения.РегистрБухгалтерии.Добавить();
	Проводка.ЮрЛицо = ЮрЛицо;
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.ПланСчетов.С18;
	Проводка.СчетКт = ПланыСчетов.ПланСчетов.С60;
	Проводка.СубконтоКт.Контрагенты = Контрагент;
	Проводка.Сумма = Товары.Итог("СуммаНДС");
	
КонецПроцедуры
