
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура", "Количество, Сумма");
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.СтоимостьТоваров.Записывать = Истина;
	Движения.РегистрБухгалтерии.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		Движение = Движения.СтоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Партия = Ссылка;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Стоимость = ТекСтрокаТовары.Сумма;
		
		Проводка = Движения.РегистрБухгалтерии.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.ПланСчетов.ТоварыНаСкладах;
		Проводка.СчетКт = ПланыСчетов.ПланСчетов.РасчетыСПоставщикамиИПодрядчиками;
		Проводка.СубконтоДт.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Проводка.СубконтоДт.Склады = Склад;
		Проводка.СубконтоКт.Контрагенты = Контрагент;
		Проводка.КоличествоДт = ТекСтрокаТовары.Количество;
		Проводка.Сумма = ТекСтрокаТовары.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры
